espressif/esp-idf/examples/system/ota/partitions_ota/sdkconfig.ci.on_update_no_sb_rsa.esp32
# ESP32 supports SIGNED_APPS_RSA_SCHEME only in ECO3
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP32_REV_MIN_3=y
